title: Linux command history clear
id: 
status: experimental
description: Detects clear command history
references:
    - 
date: 2020/06/11
author: Florian Roth
logsource:
    product: linux
    service: auditd
detection:
    cmd1:
        type: 'EXECVE'
        a0: 'history'
        a1: '-c'
    cmd2:
        type: 'EXECVE'
        a0: 'rm'
        a1: '.bash_history'
    condition: 1 of them
falsepositives:
    - Admin activity
level: medium